tap "ciiiii/tap", "https://github.com/ciiiii/homebrew-tap.git"
tap "microsoft/git"
tap "openresty/brew"
tap "homebrew/cask-versions"

brew "lsd"
brew "neovim"
brew "ripgrep"
brew "gnupg"

brew "go"
brew "rustup-init"

brew "yadm"
brew "pyenv"
brew "dvm"
brew "colima"
brew "kubectl"
brew "helm"
brew "terraform"
brew "awscli"
brew "aws-vault"

brew "ciiiii/tap/kube-proxycommand"
brew "openresty/brew/openresty"

cask "iterm2"
cask "raycast"
cask "snipaste"
cask "visual-studio-code"
cask "typora"
cask "google-cloud-sdk"

cask "microsoft/git/git-credential-manager-core"
cask "homebrew/cask-versions/firefox-developer-edition"